//package Exp;
//
//import java.util.ArrayList;
//import java.util.Arrays;
//import java.util.List;
//
//public class Java_ArrayList_LinkedList {
//    public static void main(String[] args) {
//______________________________________________ СОЗДАЁМ КОЛЛЕКЦИЮ ____________________________________________________
//// Коллекция  - это список элементов.
////        List<тип объекта>
//
//        List<String> list = new ArrayList<>();                           // Создание простого списка.
//        ArrayList<String> people = new ArrayList<String>();              // Создание пустого списка как массива.
//        List <Integer> listInt = Arrays.asList(1,2,3,4,5,6,7,8,9,10);    // Создание заполненного списка.
//
//        System.out.println(listInt);                   // Вывод списка.
//_____________________________________________________________________________________________________________________
//        list.add("milk");                              // Добавление элемента.
//        list.add(1,"cola");                            // Добавление элемента по индексу
//        System.out.println(list);
//_____________________________________________________________________________________________________________________
//        people.add("Kate");
//        people.add(1,"Alice");                         // Добавление элемента по индексу
//        System.out.println(people);
//
//_____________________________________________________________________________________________________________________
//        System.out.println(list.get(1));                            // Получение элемента по индексу 1.
//_____________________________________________________________________________________________________________________
//        people.set(1, "Robert");                                    // Установка нового значения по индексу 1.
//        System.out.println(people);
//_____________________________________________________________________________________________________________________
////        people.remove("Robert");                                   // Удаление по ссылке.
//        people.remove(1);
//        System.out.println(people);
//_____________________________________________________________________________________________________________________
//        System.out.println(people.size());                          // Длина списка.
//
//___________________________________ ПРОХОД ПО СПИСКУ ЦИКЛОМ FOR. ____________________________________________________
//        for (int i = 0; i < listInt.size(); i++){
//            System.out.println(listInt.get(i));         // Вывод от 1 ло 10 в столбик.
//        }
//    }
//}
