//package Exp;
//
//public class Java_String {
//    public static void main(String[] args) {
//        // Создание строки.
//        String str1 = new String("Hot,Java");              //1 Способ
//        String str2 = "Java";                              //2 Способ
////        System.out.println(str1);                        // Вывод на консоль.
////        System.out.println(str2);                        // Вывод на консоль.
//_____________________________________________________________________________________________________________________
//______________________________________________ МЕТОДЫ _______________________________________________________________
//////        .charAt(0);                                 // Принимает индекс и возвращает символ
////        System.out.println(str1.charAt(0));
//_____________________________________________________________________________________________________________________
//////        .codePointAt();                             // Метод возвращает символ в кодировке
////        System.out.println(str1.codePointAt(1));
//_____________________________________________________________________________________________________________________
//////        .compareTo();                                 // Метод сравнивает 2 строки с учетом регистра букв.
////        System.out.println(str1.compareTo(str2));       // Сравниваем строку str1 со строкой str2.
//_____________________________________________________________________________________________________________________
//////        .compareToIgnoreCase();                     // Метод сравнивает 2 строки без учёта регистра
////        System.out.println(str1.compareToIgnoreCase(str2));
//_____________________________________________________________________________________________________________________
//////        .concat();                                // Метод складывает две строки.
////        System.out.println(str1.concat(str2));      // str1 + str2
//_____________________________________________________________________________________________________________________
//////        .equals();                                // Метод принимает другой объект и сравнивает объекты (строки)
////        System.out.println(str1.equals(str2));
//_____________________________________________________________________________________________________________________
//////        .equalsIgnoreCase(str2)                   // Метод сравнивает без учета регистра.
////        System.out.println(str1.equalsIgnoreCase(str2));
//_____________________________________________________________________________________________________________________
//////        .hashCode();                               // Метод возвращает hash Code объекта
////        System.out.println(str1.hashCode());
//_____________________________________________________________________________________________________________________
//////        .indexOf();
////        System.out.println(str1.indexOf(65));
//_____________________________________________________________________________________________________________________
//////          .isEmpty();
////        System.out.println(str1.isEmpty());
//_____________________________________________________________________________________________________________________
//////        .length();                                 // Метод возвращает длину строки.
////        System.out.println(str1.length());           // Число символов в строке.
//_____________________________________________________________________________________________________________________
////        .split();                                  // Принимает разделитель и возвращает массив[] String
////        String [] strings = str1.split(",");       //Делит массив по разделителю (при этом разделитель "удаляет").
////        for (String element: strings){
////            System.out.println(element);
////        }
//_____________________________________________________________________________________________________________________
//////        .substring();                             // Вырезает из строки строку в диапазоне от и до.
////        System.out.println(str1.substring(2,6));    // Выводит то, что внутри диапазона.
//_____________________________________________________________________________________________________________________
//////        .toCharArray();                           // Разбивает строку посимвольно.
////        char [] charArray = str1.toCharArray();
////        for (char element: charArray){
////            System.out.println((element));
////        }
//_____________________________________________________________________________________________________________________
////        .toLowerCase()                    // Метод приводит все символы к нижнему регистру (все символы маленькие).
//        System.out.println(str1.toLowerCase());
//_____________________________________________________________________________________________________________________
////        .toUpperCase()                                        // Все символы высокого регистра (все символы большие)
//        System.out.println((str1.toUpperCase()));
//_____________________________________________________________________________________________________________________
////        .trim()                            // Метод обрезает пробелы в начале и в конце строки.
//        System.out.println(str1.trim());
//_____________________________________________________________________________________________________________________
//___________________________________________ СТАТИЧЕСКИЕ МЕТОДЫ КЛАССА _______________________________________________
////        .valueOf(65)                      // Метод преобразует переменную заданного типа в строку.
//        System.out.println(String.valueOf(65));
//// или можно записать так:
//        String str3 = String.valueOf(65);   // строка 65
//_____________________________________________________________________________________________________________________
////        .copyValueOf()                        // Метод принимает массив char и преобразует в строку
//        System.out.println(String.copyValueOf());
//_____________________________________________________________________________________________________________________
//    }
//
//}